docs(): Review and lean available documentation
